# -*- coding:utf-8*-
import sys
reload(sys)
sys.setdefaultencoding('utf-8')
import time
import requests
import os
time1=time.time()
import pandas as pd
import json
import urllib
################定义数据结构列表存储数据####################
shixin=open("shixin.txt","a")
################循环发送请求解析数据#######################
def chaxun(name1):
    name=urllib.quote(name1)
    for i in range(1,25):
        print '正在抓取第'+str(i)+"页................................."

        url="https://sp0.baidu.com/8aQDcjqpAAV3otqbppnN2DJv/api.php?resource_id=6899&query=%E5%A4%B1%E4%BF%A1%E8%A2%AB%E6%89%A7%E8%A1%8C%E4%BA%BA%E5%90%8D%E5%8D%95&cardNum=&iname="+name+"&areaName=&pn="+str(i*10)+"&rn=10&ie=utf-8&oe=utf-8&format=json"
        head={
"Host": "sp0.baidu.com",
"Connection": "keep-alive",
"User-Agent": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/60.0.3112.101 Safari/537.36",
"Accept": "*/*",
"Referer": "https://www.baidu.com/s?ie=utf-8&;f=3&;rsv_bp=1&;tn=95943715_hao_pg&;wd=%E8%80%81%E8%B5%96&;oq=%25E8%2580%2581%25E8%25B5%2596&;rsv_pq=ec5e631d0003d8eb&;rsv_t=b295wWZB5DEWWt%2FICZvMsf2TZJVPmof2YpTR0MpCszb28dLtEQmdjyBEidZohtPIr%2FBmMrB3&;rqlang=cn&;rsv_enter=0⪯fixsug=%25E8%2580%2581%25E8%25B5%2596&;rsp=0&;rsv_sug9=es_0_1&;rsv_sug=9",
"Accept-Encoding": "gzip, deflate, br",
"Accept-Language": "zh-CN,zh;q=0.8"
        }
        ht=requests.get(url,headers=head)
        html=ht.content
        if (ht.status_code==200):
            try:
                html_json=json.loads(html)
                html_data=html_json['data']
                for each in html_data:
                    k=each['result']
                    for each in k:
                        print each['iname'],each['cardNum']
                        shixin.writelines(each['iname']+"               "+each['cardNum']+"\n")
            except:
                time.sleep(10)
                continue
        else:
            break
#####################将数据组织成数据框###########################
if __name__=="__main__":
    #xin=["赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",
#"戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗",
    xin=[
"凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",
"费","廉","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",
"杜","阮","蓝","闵","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和","穆","萧","尹",
    "席", "季", "麻", "强", "贾", "路", "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",
   "虞", "万", "支", "柯", "咎", "管", "卢", "莫", "经", "房", "裘", "缪","干","解","应","宗","宣","丁","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚",
     "程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","魏","加","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓",
    "牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","姜","詹","束","龙",
     "叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","鄂","索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁","胥","能","苍","双",
    "闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","却","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农",
     "温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","艾","鱼","容","向","古","易","慎","戈","廖","庚","终","暨","居","衡","步","都","耿","满","弘",
     "匡","国","文","寇","广","东","蔚","越","夔","隆","师","巩","厍","聂","冷","辛","简","饶",
"曾","沙","鞠","丰","巢","关","相","查","江","红"]#周燕
    ming=["伟","芳","娜","静","秀","丽","强","敏","磊","阳","艳","勇","军","杰","娟","涛","超","明","娟","霞","刚","平","燕","勇","玲","桂","丹","萍","鹏","华",
          "红","超","玉","飞","英","辉","梅","鑫","波","斌","霞","平","莉","宇","浩","健","俊","帆","雪","旭","龙","凤","洋","婷","林","凯","晶","欢","颖","慧",
              "佳","倩","亮","成","超","琴","兰","畅","云","宁","洁","峰","柳","淑","春","海","晨","欢","冬","龙","瑞","志","红","兵","雷","东","琳","帅","欣","博",
          "彬","坤","想","瑞","岩","荣","小","金","文","利","楠","瑜","璐","超","海","浩","昊","皓","钢","华","文","台","从","丰","风","锋","冯","奇","健","雄","乔","毅"
          ,"坤","天","宁","宏","冰","银","立","明","鑫","龙","一","星","欣","嘉","雅","邪","心","梅","清","然","丹","梓","志","菲","花","学","平","近","梦","宝","瑶","青","泽","山",
          "永","聪","家","的","鸿","洪","武","正","路","潇","艳","蓉","彬","长","夏","默","轩","振","兵","方","森","发","奕","昆","水","发","思","哲","康","侠","衡","富","河","昭",
          "树","同","慧","光","会","汇","恩","全","权","国","春","纯","小","珍","荣","容","磊","永","君","俊","彩","财","采","易","意","恺","锴","智","熙","汐","垚","耀","虎","寿","松","福","忠","义","礼",
          "爱","艾","廖","辽","丘","秋","冬","春","夏","南","西","北","中","上","下","左","右","前","后","候","侯","启","琪","琦","午","悟","微","位","未","维","威","蔚","唯",
          "锐","蕊","芮","茹","如","儒","若","特","晚","早","豪","绣","俢","操","备","谷","固","贵","桂","圭","机","绩","吉","继","籍","藉","河","江","赫","贺","禾","核",
          "芹","勤","钦","沁","覃","芩","情","轻","晴","庆","尹","茵","殷","寅","荫","盈","影","莹","樱","瑛","滢","莺","荧","丁","鼎","航","霖","麟","璘","磷","屏","培","皮",
          "网","五","悟","湾","物","玮","沃","任","润","瑞","团","通","台","条","腾","婷","田","堂","铁","泰","土","图","途","月","亿","艳","豫","源","野","业","阳","元","缘",
          "桃","淘","排","派","飘","段","度","道","符","帆","粉","古","公","根","果","冠","港","故","卡","科","慷","连","列","烈","流","蓝","雷","联","令","楼","轮","乐","离","民","马"]
    """for i in xin:
        chaxun(i)
        time.sleep(10)"""
    for i in xin:
        for n in ming:
            xm=i+n
            chaxun(xm)
            time.sleep(5)
time2=time.time()
print u'ok,爬虫结束!'
print u'总共耗时:'+str(time2-time1)+'s'
